parampatel7/STM32F746-Discovery-Kit/i2c_baremetal/Core/Src/main.c
#include "stm32f7xx.h"
#include <string.h>

// EEPROM and I2C configuration
#define EEPROM_ADDR       (0x50 << 1)    // 7-bit address shifted for 8-bit
#define EEPROM_MEM_ADDR   0x00
#define I2C_TIMEOUT       100000

uint8_t writeData[] = "LEMT";
uint8_t readData[sizeof(writeData)] = {0};

/* === System Clock @ 216 MHz using HSE + PLL === */
void SystemClock_Config(void) {
    // HSE ON
    RCC->CR |= RCC_CR_HSEON;
    while (!(RCC->CR & RCC_CR_HSERDY));

    // Power and overdrive
    RCC->APB1ENR |= RCC_APB1ENR_PWREN;
    PWR->CR1 |= PWR_CR1_ODEN;
    while (!(PWR->CSR1 & PWR_CSR1_ODRDY));
    PWR->CR1 |= PWR_CR1_ODSWEN;
    while (!(PWR->CSR1 & PWR_CSR1_ODSWRDY));

    FLASH->ACR = FLASH_ACR_LATENCY_7WS;

    // PLL config: HSE = 25MHz -> VCO = 1080MHz -> SYSCLK = 216MHz
    RCC->PLLCFGR = (25 << RCC_PLLCFGR_PLLM_Pos) |
                   (432 << RCC_PLLCFGR_PLLN_Pos) |
                   (0 << RCC_PLLCFGR_PLLP_Pos) |  // PLLP = /2
                   (RCC_PLLCFGR_PLLSRC_HSE) |
                   (9 << RCC_PLLCFGR_PLLQ_Pos);

    RCC->CR |= RCC_CR_PLLON;
    while (!(RCC->CR & RCC_CR_PLLRDY));

    RCC->CFGR |= RCC_CFGR_SW_PLL;
    while ((RCC->CFGR & RCC_CFGR_SWS_Msk) != RCC_CFGR_SWS_PLL);

    RCC->CFGR |= RCC_CFGR_HPRE_DIV1;
    RCC->CFGR |= RCC_CFGR_PPRE1_DIV4;
    RCC->CFGR |= RCC_CFGR_PPRE2_DIV2;
}

/* === GPIOB Configuration for I2C1 (PB6 - SCL, PB7 - SDA) === */
void GPIO_I2C1_Config(void) {
    RCC->AHB1ENR |= RCC_AHB1ENR_GPIOBEN;

    // Alternate Function mode
    GPIOB->MODER &= ~((3 << (6 * 2)) | (3 << (7 * 2)));
    GPIOB->MODER |= (2 << (6 * 2)) | (2 << (7 * 2));  // AF mode

    // Open-drain + Pull-up
    GPIOB->OTYPER |= (1 << 6) | (1 << 7);
    GPIOB->PUPDR |= (1 << (6 * 2)) | (1 << (7 * 2));  // Pull-up

    // High speed
    GPIOB->OSPEEDR |= (3 << (6 * 2)) | (3 << (7 * 2));

    // AF4 (I2C1)
    GPIOB->AFR[0] |= (4 << (6 * 4)) | (4 << (7 * 4));
}

/* === I2C1 Peripheral Init === */
void I2C1_Config(void) {
    RCC->APB1ENR |= RCC_APB1ENR_I2C1EN;
    I2C1->CR1 &= ~I2C_CR1_PE;

    // 100kHz timing - from CubeMX or ST AN4235
    I2C1->TIMINGR = 0x20404768;
    I2C1->CR1 |= I2C_CR1_PE;
}

/* === EEPROM Write (bare-metal I2C) === */
uint8_t EEPROM_Write(uint8_t memAddr, uint8_t* data, uint16_t size) {
    // Start + write addr + size
    I2C1->CR2 = (EEPROM_ADDR & 0xFE) |
                (size + 1) << I2C_CR2_NBYTES_Pos |  //  +1 as data bytes + EEPROM Address
                I2C_CR2_AUTOEND |
                I2C_CR2_START;

    while (!(I2C1->ISR & I2C_ISR_TXIS));
    I2C1->TXDR = memAddr; // memory address

    for (uint16_t i = 0; i < size; i++) {
        while (!(I2C1->ISR & I2C_ISR_TXIS));
        I2C1->TXDR = data[i];
    }

    while (!(I2C1->ISR & I2C_ISR_STOPF));
    I2C1->ICR |= I2C_ICR_STOPCF;
    return 0;
}


/* === EEPROM Read === */
uint8_t EEPROM_Read(uint8_t memAddr, uint8_t* data, uint16_t size) {
    // Phase 1: Send memory address
    I2C1->CR2 = (0x50 << 1) |                  // 7-bit address
                (1 << I2C_CR2_NBYTES_Pos);     // 1 byte
    I2C1->CR2 &= ~I2C_CR2_RD_WRN;              // Write mode
    I2C1->CR2 &= ~I2C_CR2_AUTOEND;
    I2C1->CR2 |= I2C_CR2_START;

    while (!(I2C1->ISR & I2C_ISR_TXIS));
    I2C1->TXDR = memAddr;

    while (!(I2C1->ISR & I2C_ISR_TC));

    // Phase 2: Read data
    I2C1->CR2 = (0x50 << 1) |
                (size << I2C_CR2_NBYTES_Pos) |
                I2C_CR2_RD_WRN |
                I2C_CR2_AUTOEND |
                I2C_CR2_START;

    for (uint16_t i = 0; i < size; i++) {
        while (!(I2C1->ISR & I2C_ISR_RXNE));
        data[i] = I2C1->RXDR;
    }

    while (!(I2C1->ISR & I2C_ISR_STOPF));
    I2C1->ICR |= I2C_ICR_STOPCF;
    return 0;
}



int main(void) {
    HAL_Init();             // For SysTick + HAL_Delay
    SystemClock_Config();   // 216 MHz clock
    GPIO_I2C1_Config();     // PB6/7 for I2C1
    I2C1_Config();          // Bare-metal I2C setup

    EEPROM_Write(EEPROM_MEM_ADDR, writeData, sizeof(writeData));
    HAL_Delay(15);  // EEPROM write cycle

    EEPROM_Read(EEPROM_MEM_ADDR, readData, sizeof(readData));

    if (memcmp(writeData, readData, sizeof(writeData)) == 0) {
        // success: add LED toggle or UART print if needed
    } else {
        // failure
    }

    while (1);
}
